---
kind: enumMember
id: F:Autodesk.Revit.DB.AdaptivePointOrientationType.ToInstance
enum: Autodesk.Revit.DB.AdaptivePointOrientationType
source: html/95bf6f69-8714-5342-8a43-ad4f6c8b05a7.htm
---
# Autodesk.Revit.DB.AdaptivePointOrientationType.ToInstance

The adaptive point will be oriented to the coordinate system of the adaptive
 family instance the point is part of. This is the default orientation of adaptive points. This option was previously named: FamilyOrthogonal